---
kind: property
id: P:Autodesk.Revit.DB.FamilyThermalProperties.SolarHeatGainCoefficient
source: html/345f8aa5-b7bb-f8d8-c7fc-f2ed70fbadbf.htm
---
# Autodesk.Revit.DB.FamilyThermalProperties.SolarHeatGainCoefficient Property

The solar heat gain coefficient.

## Syntax (C#)
```csharp
public double SolarHeatGainCoefficient { get; }
```